
	.586 ; Вказуємо покоління процесора;
	.model flat, stdcall;
	.stack
	.data
	; Оголошуємо змінні, які будуть брати участь в обчисленні;
	a dd ?	 ; У a буде записано результат;
	b dd 300 ; b дорівнює 300;
	f dd 250 ; f дорівнює 250;
	; Закінчуємо оголушавіти змінні;
	.code

	Begin: ; Оголошуємо початок лістингу команд;

	Xor eax,eax	; Очищуємо регистр eax;

	Mov eax,b	; eax[b] ;Відправляємо змінну b у регістр eах;
	Add eax,f	; eax[b + f] ;Виконуємо операцію додавання b + f;

	Shr eax, 4	; eax[(b + f)/16] ; Оскільки ділення призводиться 
	; на число, яке є двійкою у 4й степені (2^(4)=16), 
	; то виконуємо операцію зсуву значення ах вправо на 4 розряди;

	Sub eax, 25 ; eax[(b+f)/16-25] ; Виконуємо операцію віднімання результату;

	Mov a,eax ; Пересилаємо результат у змінну а.

	end Begin



